<?php
return [
    '0' => '請輸入正確的代碼',

    '2' => '參數錯誤',
    '3' => 'TOKEN取權限失敗',
    '4' => '不允許的查詢條件',

    // 查詢 1XX
    '100' => '查詢失敗',
    '101' => '查詢成功',
    '103' => '查詢失敗，此帳號當年度未註冊所屬身分。',
    '104' => '版本過舊，無法繼續使用。', //WebService SOAP Error
    '105' => '已有新版本，可更新使用',
    '106' => '匯出成功',

    // 修改 2XX
    '200' => '修改失敗',
    '201' => '修改成功',

    //
    '404' => '上傳失敗',
    '405' => '上傳成功',
    '406' => '伺服器錯誤',

    // 刪除 5XX
    '500' => '刪除失敗',
    '501' => '刪除成功',

    /*
     * USER
     */
    // 登入 3XX
    '300' => '登入失敗',
    '301' => '登入成功',
    '302' => '登入失敗，請檢查輸入【帳號、密碼】是否正確。',
    '303' => '登出成功',
    '304' => '登出失敗',
    '305' => '待審核中',
    '306' => '未通過審核',
    '307' => '帳號名稱已存在',
    '308' => '帳號已停用、已到期，或者尚未開通。',
    '309' => '新增帳號成功。',

    '310' => 'Token有效',
    '311' => 'Token無效',
    // '312' => 'Token驗證成功',
    // '313' => 'Token驗證失敗',

    //設定帳密 4XX
    '400' => '設定失敗。',
    '401' => '設定成功。',
    '402' => '設定失敗。使用者資訊校驗失敗，請檢查輸入。',

    //驗證
    '700' => '身分驗證失敗。', // access_token invalid.
    '701' => '身分驗證失敗。', // request ip auth failed.
    '702' => '身分驗證失敗。', // 無法解讀bearer token

    '999' => '驗證失敗',

    //格式錯誤
    '2001' => '輸入經緯度其中一項為0，不予寫入。',

    //API測試期間提供用
    '80405' => '上傳成功(API測試期間)',
];
